In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:

# Let's create a dframe to work with (Highest elevation cities in USA)
dframe = DataFrame({'city':['Alma','Brian Head','Fox Park'],
                    'altitude':[3158,3000,2762]})

#Show
dframe

   altitude        city
0      3158        Alma
1      3000  Brian Head
2      2762    Fox Park

In [3]:
#Now let's say we wanted to add a column for the States, we can do that with a mapping.
state_map={'Alma':'Colorado','Brian Head':'Utah','Fox Park':'Wyoming'}

In [6]:
# Now we can map that data to our current dframe
dframe['state'] = dframe['city'].map(state_map)

In [7]:
#Show result
dframe

   altitude        city     state
0      3158        Alma  Colorado
1      3000  Brian Head      Utah
2      2762    Fox Park   Wyoming

In [8]:
# Mapping is a great way to do element-wise transfomations and other data cleaning operations!